<!-- 	

	ตัวเเปรใน function  กรณีมีชื่อตัวเเปร   ซ้ำกัน นอก function
	PHP มี 2 ประเภท 
	- ประเภท โลคอล (Local)
	- ประเภท โกลบอล (Gobal)
	
	ตัวเเปร โกลบอล คือ ขอบเขตการใช้งานทั่วทั้งโปรเเกรม 
	ทุกส่วนของโปรเเกรมจะรู้จักตัวเเปรนี้ ใช้ คำสั่ง global หน้าชื่อตัวเเปรที่ต้องการ  
-->

<?php 
	function testvar()
	{
		global $a;
		$a = 20;
		echo "ตัวเเปร \$a ภายใน function มีค่าเท่ากับ $a";
	}
	$a = 200;
 	echo "ตัวเเปร \$a ภายนอก function มีค่าเท่ากับ $a";
 	testvar();
 	$a++;
 	echo "ตัวเเปร \$a หลังเพิ่มค่า $a";
 ?>