<!-- 	

	ตัวเเปรใน function  กรณีมีชื่อตัวเเปร   ซ้ำกัน นอก function
	PHP มี 2 ประเภท 
	- ประเภท โลคอล (Local)
	- ประเภท โกลบอล (Gobal)

ตัวเเปร โลคอล คือ ขอบเขตการใช้งาน บริเวณใดหนึ่งเท่านั้น ใช้งานเฉพาะภายใน Function เท่านั้น
		การใช้งานภายใน function เเละ ใช้งานภายนอกเป็นชื่อเดียวกัน ถือว่าตัวเเปร 2 ตัวนี้
	 เป็นคนละตัว กับ ตัวเเปร บริเวณ นอก function   


-->

<?php 
	function testvar()
	{
		$a = 20;
		echo "ตัวเเปร \$a ภายใน function มีค่าเท่ากับ $a";
	}
	// ตัวเเปร $a ใน function จะไม่ใช่ตัวเดียวกับ ตัวเเปร $a นอก Function
	// ขอบเขตของตัวเเปร $a ใน function จะใช้ถึงเเค่จบ function เท่านั้น 
	$a = 200; 
 	echo "ตัวเเปร \$a ภายนอก function มีค่าเท่ากับ $a";
 	testvar();
 	$a++;
 	echo "ตัวเเปร \$a หลังเพิ่มค่า $a";
 	
 ?>

 