<!-- 
	เขียนโปรเเกรมภาษา PHP เพื่อสามารถติดต่อกับ เเละเช้าถึง 
	ฐานข้อมูล MYSQL

	เข้าใช้งานฐานข้อมูล MYSQL ได้ต้องรู้ชื่อ 
	ผู้ใช้งาน (Username) รหัสผ่าน (Password) ของ MySQl ของเราที่ใช้เป็น ฐานข้อมูล 
	เช่น phpmyadmin เป็นต้น

	ต้องเรียนรู้คำสั่งที่ใช้เชื่อมต่อ MySQL เเละหลังจากเข้าถึง MySQL 
	เสร็จเเล้ว ต้องทำการปิดการเชื่อมต่อ MySQL

	รูปเเเบบการเชื่อมต่อ
	mysqli_connect("hostname","username","password");

	คำสั่งนี้ ถ้าสามารถเชื่อมต่่อ MySQL ได้ จะส่งผลลัพธ์ตัวเเปรการเชื่อมต่อ 
	ซึ่ง นำตัวเเปรนี้ไปใช้งาน ในคำสั่งอื่นต่อไป ถ้าไม่สามารถเชื่อมต่อ MySQL 
	จะส่งผลลัพธ์เป็น ค่าเท็จ (False)

	คำสั่งปิดการเชื่อมต่อ จบการใช้งาน MySQL
	mysqli_close(ตัวเเปรการเชื่อมต่อจากคำสั่ง mysqli_connect);

	
	เเนะนำให้เเจ้งความผิดพลาดที่เกิดจากการเชื่อมต่อ MySQL 
	คือ คำสั่ง mysqli_error()
	โดยจะบอกเหตุผลว่ามี ความผิดพลาดอะไรเกิดขึ้น  
	สามารถนำมาประยุกต์ กับ คำสั่ง  mysqli_connect ได้

	ลองกรอก username , password ผิดก็จะไม่สามารถเชื่อมต่อได้ ก็จะเเจ้งเตือนด้วยคำสั่ง mysqli_error()

 -->

<!-- 
		ทางปฏิบัติการเข้าถึงฐานข้อมูลใดๆ จะไม่อนุญาติให้ผู้ใช้งานทั่วไป มีสิทธฺเข้าถึงได้ 
		เช่น โปรเเกรม phpmyadmin 
		เพราะ ผู้ใช้ทั่วไปอาจจะเข้าไป ลบ เเก้ไข ใดๆ ที่อาจส่งผลเสียหายต่อข้อมูล 

		โดยเฉพาะอย่างยิ่งข้อมูลที่เป็น ความลับองค์กร 

		ดังนั้น เราจึงเขียนโปรเเกรมขึ้น มาเพื่อให้สามารถเข้าถึงข้อมูลในฐานข้อมูลได้  เรียกโปรเกรมลักษณะนี้ว่า Font-end 

		โปรเเกรมภาษ่า PHP มีคำสั่ง จัดเตรียมให้สามารถเข้าถึง ข้อมูลในฐานข้อมูลไว้เเล้ว เช่น

		คำสั่ง เชื่อมต่อ ปิดการเชื่อต่อฐานข้อมูล  คำสั่งในการจัดการฐานข้อมูล MySQL ซึ่งทำให่้สามารถเข้าถึงข้อมูล ทั้ง เพิ่ม ลบ เเก้ไข เรคอร์ด ต่างๆ ภายใน ตารางฐานข้อมูลได้
	--->




<?php 
	$link = mysqli_connect("localhost","root","123456");
	if($link){
		echo "Connected successfully <br>";
		echo "Connection number= $link->thread_id";
		mysqli_close($link);
	}
	else
	{
		die('Could not connect : '.mysqli_error());
	}
 ?>